{"Subtitle":"While the transmission of speech by radio has a long history, the first devices that were wireless, mobile, and also capable of connecting to the standard telephone network are much more recent. Along with the process of developing a more portable technology, and a better interconnections system, drastic changes have taken place in both the networking of wireless communication and the prevalence of its use, with smartphones becoming common globally and a growing proportion of Internet access now done via mobile broadband.","Title":"Mobile Phones","CustomTheme":{"GoogleFonts":[],"DefaultBackgroundColor":"#c0c0c0","DefaultFontColor":"#000000","DefaultImageRadius":0,"EventTitleLineColor":"#808080","DefaultNoteFontColor":"","EventBgColor":"#ffffff"},"DataSource":"source: Wikipedia, 2019","DataSourceLink":"https://en.wikipedia.org/wiki/History_of_mobile_phones","Categories":[{"TagLine":null,"Title":"Networks","Id":"_kmn3dvpxi"},{"TagLine":null,"Title":"Devices","Id":"_2u9ehy9pl"},{"TagLine":null,"Title":"Services","Id":"_qdo7crwtf"}],"Links":[],"Events":[{"Link":null,"Title":"Mobile Telephone Service by AT&T","Occurences":[{"CategoryId":"_kmn3dvpxi","Year":1949}],"Description":"Mobile Telephone Service <b>MTS</b> was a rarity with only 5,000 customers placing about 30,000 calls each week. Calls were set up manually by an operator and the user had to depress a button on the handset to talk and release the button to listen. The call subscriber equipment weighed about 80 pounds (36 kg). Subscriber growth and revenue generation were hampered by the constraints of the technology. Because only three radio channels were available, only three customers in any given city could make mobile telephone calls at one time."},{"Link":null,"Title":"Improved Mobile Telephone Service by AT&T","Occurences":[{"CategoryId":"_kmn3dvpxi","Year":1965}],"Description":"AT&T introduced the first major improvement to mobile telephony in 1965, giving the improved service the obvious name of Improved Mobile Telephone Service. <b>IMTS</b> used additional radio channels, allowing more simultaneous calls in a given geographic area, introduced customer dialing, eliminating manual call setup by an operator, and reduced the size and weight of the subscriber equipment."},{"Link":null,"Id":"_xr6ydi08w","Title":"1G – Analog cellular","Occurences":[{"CategoryId":"_kmn3dvpxi","Year":1981}],"Description":"First automatic analog cellular systems deployed were NTT's system first used in Tokyo in 1979, later spreading to the whole of Japan, and <b>NMT</b> in the Nordic countries in 1981."},{"Link":null,"Id":"_l5wjdkt5l","Title":"2G – Digital cellular","Occurences":[{"Year":1990,"CategoryId":"_kmn3dvpxi"}],"Description":"In the 1990s, the 'second generation' mobile phone systems emerged. Two systems competed for supremacy in the global market: the European developed <b>GSM</b> standard and the U.S. developed <b>CDMA</b> standard. These differed from the previous generation by using digital instead of analog transmission, and also fast out-of-band phone-to-network signaling."},{"Link":null,"Id":"_8j69zodya","Title":"Motorola DynaTAC 8000X","Occurences":[{"CategoryId":"_2u9ehy9pl","Year":1983}],"Description":"On 6 March 1983, the DynaTAC 8000X mobile phone launched on the first US 1G network by Ameritech. It cost $100M to develop, and took over a decade to reach the market. The phone had a talk time of just thirty-five minutes and took ten hours to charge. Consumer demand was strong despite the battery life, weight, and low talk time, and waiting lists were in the thousands."},{"Link":null,"Id":"_g4pienyzy","Title":"IBM Simon","Occurences":[{"CategoryId":"_2u9ehy9pl","Year":1993}],"Description":"In 1993, IBM Simon was introduced. This was possibly the world's first smartphone. It was a mobile phone, pager, fax machine, and PDA all rolled into one. It included a calendar, address book, clock, calculator, notepad, email, and a touchscreen with a QWERTY keyboard. The IBM Simon had a stylus, used to tap the touch screen. It featured predictive typing that would guess the next characters as you tapped. It had applications, or at least a way to deliver more features by plugging a PCMCIA 1.8 MB memory card into the phone.","Image":{"Url":"https://timeline.entis-design.com/storage.php?action=loadBlob&id=5de0dfc603be1","Width":600,"Height":360}},{"Link":null,"Id":"_v8i4xoh2e","Title":"Text Messaging","Occurences":[{"CategoryId":"_qdo7crwtf","Year":1992}],"Description":" The first machine-generated SMS message was sent in the UK on 3 December 1992 followed in 1993 by the first person-to-person SMS sent in Finland. The advent of prepaid services in the late 1990s soon made SMS the communication method of choice among the young, a trend which spread across all ages."},{"Link":null,"Id":"_fy7lhfz0z","Title":"Mobile Payments","Occurences":[{"CategoryId":"_qdo7crwtf","Year":1998}],"Description":"Mobile payments were trialed in 1998 in Finland and Sweden where a mobile phone was used to pay for a Coca-Cola vending machine and car parking. Commercial launches followed in 1999 in Norway. The first commercial payment system to mimic banks and credit cards was launched in the Philippines in 1999 simultaneously by mobile operators Globe and Smart."},{"Link":null,"Id":"_qdgmjkzmd","Title":"Internet","Occurences":[{"CategoryId":"_qdo7crwtf","Year":1999}],"Description":"The first full internet service on mobile phones was introduced by NTT DoCoMo in Japan in 1999."},{"Link":null,"Id":"_x0y5fjrso","Title":"Multimedia Content","Occurences":[{"CategoryId":"_qdo7crwtf","Year":1998}],"Description":"2G also introduced the ability to access media content on mobile phones. In 1998 the first downloadable content sold to mobile phones was the ring tone, launched by Finland's Radiolinja (now Elisa). Advertising on the mobile phone first appeared in Finland when a free daily SMS news headline service was launched in 2000, sponsored by advertising."},{"Link":null,"Id":"_q5benr8um","Title":"3G – Mobile broadband","Occurences":[{"CategoryId":"_kmn3dvpxi","Year":2001}],"Description":" The main technological difference that distinguishes 3G technology from 2G technology is the use of packet switching rather than circuit switching for data transmission. In addition, the standardization process focused on requirements more than technology (2 Mbit/s maximum data rate indoors, 384 kbit/s outdoors, for example). The first pre-commercial trial network with 3G was launched by NTT DoCoMo in Japan in the Tokyo region in May 2001. NTT DoCoMo launched the first commercial 3G network on 1 October 2001, using the WCDMA technology."},{"Link":null,"Id":"_f9fbcz7ox","Title":"4G – Native IP networks","Occurences":[{"CategoryId":"_kmn3dvpxi","Year":2009}],"Description":"By 2009, it had become clear that, at some point, 3G networks would be overwhelmed by the growth of bandwidth-intensive applications like streaming media. Consequently, the industry began looking to data-optimized 4th-generation technologies, with the promise of speed improvements up to 10-fold over existing 3G technologies. The first two commercially available technologies billed as 4G were the WiMAX standard (offered in the U.S. by Sprint) and the LTE standard, first offered in Scandinavia by TeliaSonera."},{"Link":null,"Id":"_zgeyekuw6","Title":"iPhone & iOS","Occurences":[{"CategoryId":"_2u9ehy9pl","Year":2007}],"Description":"The first-generation iPhone was released on June 29, 2007, and multiple new hardware iterations with new iOS releases have been released since.","Image":{"Url":"https://timeline.entis-design.com/storage.php?action=loadBlob&id=5de0de7473dc2","Width":480,"Height":319}},{"Link":null,"Id":"_sk6ke81gy","Title":"Android","Occurences":[{"Year":2008,"CategoryId":"_2u9ehy9pl"}],"Description":"Initially developed by Android Inc., which Google bought in 2005, Android was unveiled in 2007, with the first commercial Android device HTC Dream launched in September 2008. "},{"Link":null,"Id":"_4inideyfa","Title":"Windows Mobile (Pocket PC)","Occurences":[{"CategoryId":"_2u9ehy9pl","Year":2000}],"Description":"Windows Mobile is a family of mobile operating systems developed by Microsoft for smartphones and Pocket PCs which originates back to Windows CE in 1996, though Windows Mobile itself first appeared in 2000 as Pocket PC 2000. It was renamed \"Windows Mobile\" in 2003, at which point it came in several versions"}],"Image":{"Url":"https://timeline.entis-design.com/storage.php?action=loadBlob&id=5de0e2ad19616","Width":1920,"Height":1440}}